auth/app/controllers/accounts_controller.rb

  def update
    respond_to do |format|
      new_role = @account.role != account_params[:role] ? account_params[:role] : nil

      if @account.update(account_params)
---
UPDATE "accounts" SET "role" = $1, "full_name" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["role", "admin"], ["full_name", ""], ["updated_at", "2021-11-10 18:50:22.417753"], ["id", 3]]

    def current_account
      if doorkeeper_token
        Account.find(doorkeeper_token.resource_owner_id)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]